Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad.Directions Property
 The directions of the decomposed selfweight load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum> Directions { get; }
Public ReadOnly Property Directions As List(Of AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum)
	Get
Property Value
Type: List<AnalysisDecomposedLoad.AnalysisDecomposedLoadDirectionEnum>
See Also
Reference
AnalysisDecomposedSelfweightLoad Class
Tekla.Structures.Analysis Namespace